# Shared formulae
brew "aria2"
brew "chezmoi"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "gmp"
brew "lazygit"
brew "libyaml"
brew "mise"
brew "neovim"
brew "openssl"
brew "readline"
brew "ripgrep"
brew "sox"
brew "starship"
brew "tree"
brew "unison"
brew "watchman"
brew "wget"
brew "zoxide"

# Shared casks
cask "claude-code"
cask "font-geist-mono-nerd-font"
cask "ghostty"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "zed"
cask "zen"

{{- if eq .machine_type "work" }}

# Work formulae
brew "azure-cli"
brew "nss"
brew "docker-compose"
brew "lazydocker"
brew "mkcert"
brew "mutagen-io/mutagen/mutagen"
brew "python-setuptools"
brew "yarn"

# Work casks
cask "figma"
cask "google-chrome"
cask "microsoft-edge"
cask "mockoon"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "sequel-ace"

{{- else }}

# Personal formulae
brew "vercel-cli"
brew "xcodes"

# Personal casks
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "zwift"

{{- end }}
