# Homebrew
tap "homebrew/bundle"       # Bundle Brewfile

# Formulae
brew "aria2"                # Download with resuming and segmented downloading
brew "azure-cli"            # Command-line tools for Azure  
brew "curl"                 # Retrieve files from HTTP, HTTPS, or FTP servers
brew "docker-compose"       # Isolated development environments using Docker
brew "fd"                   # Simple, fast and user-friendly alternative to find
brew "fzf"                  # Command-line fuzzy finder written in Go
brew "gh"                   # GitHub command-line tool
brew "gmp"                  # GNU Multiple Precision Arithmetic Library
brew "lazygit"              # Simple terminal UI for Git commands
brew "libyaml"              # YAML Parser and emitter library
brew "lsd"                  # Clone of ls with colorful output, file type icons, and more
brew "mise"                 # Polyglot runtime manager (ASDF Rust clone)
brew "neovim"               # Ambitious Vim-fork focused on extensibility and agility
brew "openssl"              # Cryptography and SSL/TLS Toolkit
brew "readline"             # Library for command-line editing
brew "ripgrep"              # Search tool like grep and The Silver Searcher
brew "starship"             # Cross-shell prompt for astronauts
brew "stow"                 # Organize software neatly under a single directory tree (e.g., /usr/local)
brew "tree"                 # Display directories as trees (with optional color/HTML output)
brew "unison"               # File synchroniser
brew "vercel-cli"           # Command-line interface for Vercel
brew "watchman"             # Watch files and take action when they change 
brew "wget"                 # Internet file retriever
brew "xcodes"               # Best command-line tool to install and switch between multiple versions of Xcode
brew "yarn"                 # Bottle (binary package) installation support provided.
brew "zoxide"               # Shell extension to navigate your filesystem faster

# Casks
cask "1password"                      # Password manager that keeps all passwords secure behind one password
cask "arc"                            # Chromium based browser
cask "docker"                         # App to build and share containerised applications and microservices
cask "font-caskaydia-cove-nerd-font"  # Nerd Font version of CaskaydiaCove
cask "figma"                          # Collaborative interface design tool
cask "firefox@developer-edition"      # Web browser
cask "google-chrome"                  # Web browser
cask "microsoft-edge"                 # Web browser
cask "mockoon"                        # Create mock APIs in seconds
cask "obsidian"                       # Knowledge base that works on top of a local folder of plain text Markdown files
cask "postman"                        # Collaboration platform for API development
cask "raycast"                        # Control your tools with a few keystrokes
cask "sequel-ace"                     # MySQL/MariaDB database management
cask "spotify"                        # Music streaming service
cask "visual-studio-code"             # Open-source code editor
cask "wezterm"                        # GPU-accelerated cross-platform terminal emulator and multiplexer